МПР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАлкогольнойПродукцииЕГАИС</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Крепость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДАЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодконтрольнаяПродукцияВЕТИС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительИмпортерАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйНоминал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводДробногоКоличества</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобенностьУчета</name>
    <type>
      <types>EnumRef.ОсобенностиУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродукцияМаркируемаяДляГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМВид</name>
    <type>
      <types>EnumRef.ВидыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМСпособВыпускаВОборот</name>
    <type>
      <types>EnumRef.СпособыВыпускаВОборотГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМРазмер</name>
    <type>
      <types>EnumRef.РазмерыКиЗГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМехаГИСМ</name>
    <type>
      <types>CatalogRef.ВидыМехаГИСМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.УдалитьВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТабачнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОбувнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаНоменклатурнойКлассификации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧастичноеПогашение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияТНВЭД</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТРУ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ds_УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ds_GUID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ds_Дубль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ds_РезервироватьШтрихкоды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ds_ДатаОкончанияПродаж</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/WebServices/ds_ExchangeTSD/Module.bsl
#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьОбмен(Данные)
	
	Узел = ПринятьИзменениеПоПлану(Данные);
	
	Возврат ЗарегистрироватьВыгрузку(Узел);
	
КонецФункции

Функция ПринятьИзменениеПоПлану(СтрокаСообщения)
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
	Данные = ПрочитатьJSON(ЧтениеJson);
	
	Отправитель = ПланыОбмена.ds_ОбменДаннымиСТСД.НайтиПоКоду(Данные.From);
	ПланыОбмена.УдалитьРегистрациюИзменений(Отправитель, Данные.ReceivedNo);
	
	Для Каждого Стр Из Данные.ReceiptOrders Цикл 
		ЗагрузитьАктПриемкиТоваров(Стр);	
	КонецЦикла;	
	
	Узел = Отправитель.ПолучитьОбъект();
	Узел.НомерПринятого = Число(Данные.MessageNo);
	Узел.Записать();

	Возврат Отправитель; 
	
КонецФункции

Процедура ЗагрузитьАктПриемкиТоваров(Элемент)
	

	
КонецПроцедуры

Функция ЗарегистрироватьВыгрузку(Узел)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	ВыборкаИзменений = ПланыОбмена.ВыбратьИзменения(Узел, Узел.НомерОтправленного + 1);
	
	Данные = Новый Структура;
	Данные.Вставить("From", ПланыОбмена.ds_ОбменДаннымиСТСД.ЭтотУзел().Код);
	Данные.Вставить("ReceivedNo", Узел.НомерПринятого);
	Данные.Вставить("MessageNo", Узел.НомерОтправленного + 1);
	Данные.Вставить("Goods", Новый Массив);
	//Данные.Вставить("Groups", Новый Массив);
	Данные.Вставить("Warehouses", Новый Массив);
	Данные.Вставить("ReceiptOrders", Новый Массив);
		
	Пока ВыборкаИзменений.Следующий() Цикл
	    ОбъектОбмена = ВыборкаИзменений.Получить();
	    ТипДанных = ТипЗнч(ОбъектОбмена);
		
		Если ТипДанных = Тип("СправочникОбъект.Номенклатура") Тогда
			Если ОбъектОбмена.ЭтоГруппа Тогда 
				//Данные.Groups.Добавить(ВыгрузитьГруппаНоменклатуры(ОбъектОбмена.Ссылка));
			Иначе	
				Данные.Goods.Добавить(ВыгрузитьНоменклатура(ОбъектОбмена.Ссылка));
			КонецЕсли;
		ИначеЕсли ТипДанных = Тип("СправочникОбъект.Склады") Тогда 
			Данные.Warehouses.Добавить(ВыгрузитьСклад(ОбъектОбмена.Ссылка));
		ИначеЕсли ТипДанных = Тип("ДокументОбъект.ds_АктПриемкиТоваров") Тогда 
			Данные.ReceiptOrders.Добавить(ВыгрузитьАктПриемкиТоваров(ОбъектОбмена.Ссылка));
		ИначеЕсли ТипДанных = Тип("РегистрСведенийНаборЗаписей.Штрихкоды") Тогда 
			Данные.Barcodes.Добавить(ВыгрузитьШтрихкоды(ОбъектОбмена));
		КонецЕсли;	
	КонецЦикла;
	
	ЗаписатьJSON(ЗаписьJSON, Данные);
	
	УзелОбъект = Узел.ПолучитьОбъект();
	УзелОбъект.НомерОтправленного = Данные.MessageNo;
	УзелОбъект.Записать();

	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ВыгрузитьГруппаНоменклатуры(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Code,
	|	Номенклатура.Наименование КАК Name,
	|	Номенклатура.ds_УИД КАК UID,
	|	Номенклатура.ds_GUID КАК GUID,
	|	ЕСТЬNULL(Номенклатура.Родитель.ds_GUID, """") КАК Parent_GUID,
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка
	|	И Номенклатура.ds_GUID <> """"
	|";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,UID,GUID,Parent_GUID,Level",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),Выборка.UID,Выборка.GUID,Выборка.Parent_GUID,Выборка.Ссылка.Уровень());
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьНоменклатура(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Code,
	|	Номенклатура.Артикул КАК VendorCode,
	|	Номенклатура.Наименование КАК Name,
	|	Номенклатура.УИД КАК UID,
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,VendorCode,UID,GUID",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),СокрЛП(Выборка.VendorCode),Выборка.UID,XMLСтрока(Выборка.Ссылка));
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьСклад(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Код КАК Code,
	|	Склады.Наименование КАК Name,
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура("Code,Name,GUID",
	СокрЛП(Выборка.Code),СокрЛП(Выборка.Name),Строка(Выборка.Ссылка.УникальныйИдентификатор()));
	
	Возврат Результат;
	
КонецФункции	

Функция ВыгрузитьАктПриемкиТоваров(Ссылка)
	

	
КонецФункции	

Функция ВыгрузитьШтрихкоды(НаборЗаписей)
	

	
КонецФункции	

#КонецОбласти
